{
  "_meta": {
    "purpose": "Backward-facing step test case (ported from https://github.com/joove123/k-epsilon/blob/main/BackStepSimulation.py)",
    "notes": "Re_h=1000 target, coarse mesh for debug, ER=2 (so H_inlet = h = 1).",
    "source": "BackStepSimulation.py",
    "source_note": "Legacy FEniCS reference kept for reproducibility while running in k-omega form."
  },
  "geometry": {
    "type": "bfs",
    "_type": "Selects BFS geometry branch in the dispatch layer.",
    "step_height": 1.0,
    "_step_height": "h = channel step height; kept at 1.0 so that ER=2 gives H_inlet=1.0 and coarse geometry is unchanged.",
    "expansion_ratio": 2.0,
    "_expansion_ratio": "ER = H_outlet / H_inlet. Set to 2 to match the requested ratio and default benchmark setup.",
    "upstream_length": 5.0,
    "_upstream_length": "L_upstream/h; 5 keeps a short developing inlet section before the step while staying quick to solve.",
    "downstream_length": 20.0,
    "_downstream_length": "L_downstream/h; 20 captures the recirculation bubble and reattachment growth without excessive cell count.",
    "y_first": 0.005,
    "_y_first": "Wall spacing to keep the first layer ~5e-3 for a stable coarse start in this case.",
    "Nx_upstream": 30,
    "_Nx_upstream": "Streamwise cells on inlet-side leg; 30 is intentionally coarse for debugging speed.",
    "Nx_downstream": 120,
    "_Nx_downstream": "Streamwise cells downstream to resolve shear-layer development and recirculation.",
    "Ny_inlet": 20,
    "_Ny_inlet": "Inlet height resolution (Ny_h).",
    "Ny_outlet": 40,
    "_Ny_outlet": "Outlet height resolution; doubled to include both step region and full downstream channel height.",
    "mesh_type": "quad",
    "_mesh_type": "Structured quadrilateral layout for consistency with the existing BFS mesh pipeline.",
    "stretching": "geometric",
    "_stretching": "Cell growth away from the step; geometric kept to avoid abrupt transitions in current mesh generator.",
    "growth_rate": 1.15,
    "_growth_rate": "x-direction growth factor in the coarse tail region downstream of x/H ~ 10."
  },
  "nondim": {
    "Re_tau": 1000.0,
    "_Re_tau": "Set to 1000 for the requested Re_h=1000 baseline in this solver's nondimensional form.",
    "use_body_force": false,
    "_use_body_force": "Keep pressure-driven forcing off for BFS so inlet-driven behavior from geometry BCs is retained."
  },
  "turb": {
    "model": "wilcox2006",
    "_model": "k-omega model retained; the reference repo is k-epsilon but this repository’s production branch uses k-omega.",
    "beta_star": 0.09,
    "_beta_star": "Default Wilcox value; left unchanged to keep k-omega closure consistent across cases.",
    "nu_t_max_factor": 200.0,
    "_nu_t_max_factor": "Turbulence-viscosity cap (relative to molecular viscosity) kept moderate for robust coarse-mesh behavior.",
    "omega_min": 0.1,
    "_omega_min": "Lower omega bound avoids ν_t runaway in low-strain core regions.",
    "k_min": 1e-10,
    "_k_min": "Positive floor for k to keep sqrt and division well-conditioned.",
    "k_max": 10.0,
    "_k_max": "Small safety cap for coarse-grid k growth during bootstrap iterations.",
    "C_lim": 0.875,
    "_C_lim": "Durbin stress limiter retained from previous BFS tuning; can be set to 0 to disable.",
    "_reference_k_init": "Original BackStepSimulation.py used k=1.73, ε=1.46 for k-ε ICs; equivalent scaling is carried by initial guesses below."
  },
  "solve": {
    "dt": 0.01,
    "_dt": "Initial pseudo-time step.",
    "dt_max": 0.15,
    "_dt_max": "Limiter for adaptive stepping; kept from the existing BFS workflow.",
    "dt_growth": 1.01,
    "_dt_growth": "Conservative growth after residual decrease; matches previous stable BFS tuning.",
    "dt_growth_threshold": 0.95,
    "_dt_growth_threshold": "Only increase dt once residual ratio is comfortably below this threshold.",
    "cfl_target": 0.7,
    "_cfl_target": "Same CFL target used in your recent BFS run; avoids aggressive early growth.",
    "t_final": 500000.0,
    "_t_final": "Pseudo-time cap retained as a hard guard for non-converged edge cases.",
    "max_iter": 3000,
    "_max_iter": "Reference k-epsilon workflow used 3000 Picard-like outer iterations.",
    "steady_tol": 1e-6,
    "_steady_tol": "Residual target for outer steady convergence, aligned with reference 1e-6 tolerance style.",
    "enable_physical_convergence": false,
    "_enable_physical_convergence": "Disabled initially for parity with this coarse-mode run; can be enabled after stability is proven.",
    "physical_u_bulk_rel_tol": 1e-4,
    "_physical_u_bulk_rel_tol": "Bulk-flow monitoring tolerance when physical convergence gate is enabled.",
    "physical_tau_wall_rel_tol": 2.5e-3,
    "_physical_tau_wall_rel_tol": "Wall shear monitoring tolerance when physical convergence gate is enabled.",
    "physical_convergence_start_iter": 10,
    "_physical_convergence_start_iter": "Delay before physical checks to avoid false early stop.",
    "picard_max": 6,
    "_picard_max": "Kept at 6 to preserve current nonlinear staging behavior.",
    "picard_tol": 1e-6,
    "_picard_tol": "Inner Picard tolerance matched to the reference's 1e-6 target residual style.",
    "under_relax_k_omega": 0.1,
    "_under_relax_k_omega": "Stronger damping during k/ω coupling for the same stability rationale as reference Picard relaxation.",
    "under_relax_nu_t": 0.1,
    "_under_relax_nu_t": "Keep ν_t response damped in early bootstrap to prevent overshoot on coarse mesh.",
    "log_interval": 10,
    "_log_interval": "Console residual table cadence.",
    "snapshot_interval": 200,
    "_snapshot_interval": "Write VTX snapshots every N outer iterations.",
    "out_dir": "bfs",
    "_out_dir": "Case output root; final artifacts are placed under bfs/results by the runner.",
    "min_iter": 100,
    "_min_iter": "Minimum outer loops before considering pseudo-convergence.",
    "min_dt_ratio": 1.0e-3,
    "_min_dt_ratio": "Reject apparent convergence if dt collapses below 0.1% of initial pseudo-time step."
  }
}
